In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6,], [7, 8, 9]],
                 columns=["col01", "col02", "col03"],
                 index=["idx01", "idx02", "idx03"])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [2]:
import numpy as np

In [8]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6,], [7, 8, 9]]),
                 columns=["col01", "col02", "col03"],
                 index=["idx01", "idx02", "idx03"])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [9]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [11]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [12]:
df = pd.DataFrame({"col01":[1, 2, 3],
                   "col02":[4, 5, 6],
                   "col03":[7, 8, 9]})
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [13]:
df = pd.DataFrame({"col01":[1, 2, 3],
                   "col02":[4, 5, 6],
                   "col03":[7, 8, 9]})
df.index=["idx01","idx02","idx03"]
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [14]:
df = pd.DataFrame({"col01":[1, 2, 3],
                   "col02":[4, 5, 6],
                   "col03":[7, 8, 9]},
                   index=["idx01","idx02","idx03"])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [17]:
df = pd.DataFrame([[1, 2, 3],
                  [4, 5, 6],
                  [7, 8, 9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
df.columns=["col01","col02","col03"]
df.index=["idx01", "idx02", "idx03"]

In [19]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [20]:
df = df.rename(columns={"col01":"x", "col02":"y","col03":"z"})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [24]:
df = df.rename(index={"idx01":"W"})
df

       x  y  z
W      1  2  3
idx02  4  5  6
idx03  7  8  9

In [25]:
df["x"]

W        1
idx02    4
idx03    7
Name: x, dtype: int64

In [26]:
type(df["x"])

pandas.core.series.Series

In [27]:
df[["x"]]

       x
W      1
idx02  4
idx03  7

In [28]:
type(df[["x"]])

pandas.core.frame.DataFrame

In [30]:
df.loc["W"]

x    1
y    2
z    3
Name: W, dtype: int64